
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+PROPERTY: header-args :session *R* :results output :exports both
#+BEGIN_COMMENT
Hola esto es un archivo de ejemplo, para tener como referencia al momento de hacer mis anotaciones.

#+END_COMMENT
* Ejercicio 1

** Instrucciones

- Construye dos vectores con por lo menos 30 números enteros entre 10 y 20 (se puede repetir cada valor individual tantas veces como uno quiere)
  1) donde el promedio es mayor a la mediana y
  2) donde el promedio es menor a la mediana.
- Comprueba que cumplan con lo solicitado.
- Calcula para ambos también su mínimo, máximo y los cuartiles de 25 y 75 por ciento.
- Dibuja los diagramas de caja-bigote de los dos conjuntos en una misma gráfica.

** Soluciones

#+CAPTION: Hola codigo 1
#+BEGIN_SRC R 
  data = seq(10, 20)

  while(TRUE)
  {
      firstVec = sample(data, 30, replace=TRUE)
      prom = mean(firstVec)
      med = median(firstVec)
      if (prom < med) {
          break;
      }

  }

  while(TRUE)
  {
      secondVec = sample(data, 30, replace=TRUE)
      prom = mean(secondVec)
      med = median(secondVec)
      if (prom > med) {
          break;
      }
  }

  #printing results
  cat("vector with mean < median:", firstVec, "\n", sep=" ")
  print(summary(firstVec))
  cat("vector with mean > median:", secondVec, "\n", sep=" ")
  print(summary(secondVec))
#+END_SRC

#+RESULTS:
: vector with mean < median: 17 18 17 10 19 17 11 18 18 17 16 19 15 19 15 16 17 15 17 10 12 14 20 18 12 20 11 14 10 10
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:    10.0    12.5    16.5    15.4    18.0    20.0
: vector with mean > median: 13 16 14 17 13 16 16 11 10 16 13 14 12 13 17 20 12 10 11 12 10 15 13 20 15 19 15 17 18 11
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:    10.0    12.0    14.0    14.3    16.0    20.0


#+BEGIN_SRC R :results graphics :file boxplot.png
boxplot(firstVec, secondVec)
#+END_SRC


#+BEGIN_SRC R :results output graphics :file test.png
  library("ggplot2")
  ggplot(iris, aes(x = Sepal.Width, y = Sepal.Length, color = Species)) +
  geom_point()
#+END_SRC


